Revit 2027 API
SpatialFieldManager.ResultsVisibleInView Property
 Enables analysis results visibility in the view.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ResultsVisibleInView { get; set; }
Public Property ResultsVisibleInView As Boolean
	Get
	Set
public:
property bool ResultsVisibleInView {
	bool get ();
	void set (bool value);
}
member ResultsVisibleInView : bool with get, set
Property Value
Boolean
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace